## Production: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_quicksight_refresh_schedule.jobs`          |
|        | `aws_quicksight_refresh_schedule.notifications` |
|        | `aws_quicksight_refresh_schedule.organisation`  |
|        | `aws_quicksight_refresh_schedule.services`      |
|        | `aws_quicksight_refresh_schedule.templates`     |
| update | `aws_quicksight_refresh_schedule.login_events`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_quicksight_refresh_schedule.jobs will be created
  + resource "aws_quicksight_refresh_schedule" "jobs" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "jobs"
      + id             = (known after apply)
      + schedule_id    = "schedule-jobs"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:15"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_quicksight_refresh_schedule.login_events will be updated in-place
  ~ resource "aws_quicksight_refresh_schedule" "login_events" {
        id             = "296255494825,login-events,schedule-login-events"
        # (4 unchanged attributes hidden)

      ~ schedule {
          ~ refresh_type          = "INCREMENTAL_REFRESH" -> "FULL_REFRESH"
          ~ start_after_date_time = "2023-12-14T04:20:59" -> (known after apply)

          ~ schedule_frequency {
              ~ time_of_the_day = "07:10" -> "07:35"
              ~ timezone        = "UTC" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_quicksight_refresh_schedule.notifications will be created
  + resource "aws_quicksight_refresh_schedule" "notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications"
      + id             = (known after apply)
      + schedule_id    = "schedule-notifications"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:10"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_quicksight_refresh_schedule.organisation will be created
  + resource "aws_quicksight_refresh_schedule" "organisation" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "organisation"
      + id             = (known after apply)
      + schedule_id    = "schedule-organisation"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:30"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_quicksight_refresh_schedule.services will be created
  + resource "aws_quicksight_refresh_schedule" "services" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "services"
      + id             = (known after apply)
      + schedule_id    = "schedule-services"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:25"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_quicksight_refresh_schedule.templates will be created
  + resource "aws_quicksight_refresh_schedule" "templates" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "templatesv2"
      + id             = (known after apply)
      + schedule_id    = "schedule-templates"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:20"
              + timezone        = (known after apply)
            }
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
